Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: ལུང་བསྟན་པའི་བསྟན་པ་དེ་ཡང་ངའི་རྣ་བའི་དབང་པོ་ལ་གྲག་པར་ཡང་མ་གྱུར། ང་ཡེ་ཤེས་གཞན་དུ་རིག་པར་ཡང་མ་གྱུར།
en: My ear faculty did not hear this prophecy, nor did I cognize it through some wisdom.

source: ང་ཀུན་ཏུ་རྨོངས་པར་ཡང་མ་གྱུར། དམིགས་པར་ལྟ་བ་ལ་གནས་པ་ཡང་མེད།
en: But I was also not deluded, and nor did I maintain any view of reference points.

source: ང་སངས་རྒྱས་ལ་སངས་རྒྱས་སུ་འདུ་ཤེས་པ་ཡང་མེད།
en: I had no notion of buddhas as buddhas.

source: བདག་ལ་བདག་ཏུ་འདུ་ཤེས་པ་ཡང་མེད།
en: I had no notion of myself as myself.

source: ལུང་བསྟན་པའི་བསྟན་པ་ལ་ཡང་ལུང་བསྟན་པའི་བསྟན་པར་འདུ་ཤེས་པ་ཡང་མེད་པར་གྱུར་ཏོ། །
en: I had no notion of the prophecy as prophecy.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ལུང་བསྟན་པ་སྟེ།
en: Sāgaramati, such is a bodhisattva’s prophecy in terms of the purity of the three spheres.

source: གང་ལ་སངས་རྒྱས་སུ་འདུ་ཤེས་པ་ཡང་མེད་པ་དང་བདག་ཏུ་འདུ་ཤེས་པ་མེད་པ་དང་ལུང་བསྟན་པའི་བསྟན་པར་འདུ་ཤེས་པ་མེད་པ་འདི་ནི་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ། །
en: The lack of notions of a buddha, oneself, and a prophecy is called the purity of the three spheres.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། གང་ལ་བདག་ཏུ་འཛིན་པ་མེད་པ་དང་། སེམས་ཅན་དུ་འཛིན་པ་མེད་པ་དང་། ཆོས་སུ་འཛིན་པ་མེད་པའོ། །
en: “Moreover, Sāgaramati, the purity of the three spheres refers to no clinging to self, to beings, or to phenomena.

source: གཞན་ཡང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ནི་གང་ལ་མིང་དུ་འཛིན་པ་མེད་པ་དང་། གཟུགས་སུ་འཛིན་པ་མེད་པ་དང་། དམིགས་པར་འཛིན་པ་མེད་པའོ། །
en: Moreover, the purity of the three spheres refers to no clinging to names, forms, or reference points.

source: གཞན་ཡང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ནི་འདས་པ་ལ་ཟད་པར་ཤེས་པ་དང་། མ་འོངས་པ་ལ་མ་ཕྱིན་པར་ཤེས་པ་དང་། ད་ལྟར་བྱུང་བ་ལ་གནས་པ་མེད་པར་ཤེས་པའོ། །
en: Moreover, the purity of the three spheres is knowing the exhaustion of the past, the non-arrival of the future, and the non-existence of the present.

source: གཞན་ཡང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ནི་ལུས་ལ་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་པ་དང་། ངག་ལ་བྲག་ཅ་ལྟ་བུར་ཤེས་པ་དང་། སེམས་ལ་སྒྱུ་མ་ལྟ་བུར་ཤེས་པའོ། །
en: Moreover, the purity of the three spheres is knowing the body to be like a reflection, speech to be like an echo, and mind to be like an illusion.

source: གཞན་ཡང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ནི། ཕུང་པོ་རྣམས་ལ་ཆོས་ཀྱི་ཕུང་པོ་དང་མཉམ་པ་ཉིད་དང་། ཁམས་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པ་ཉིད་དང་། སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་ལྟ་བུར་སོར་སོར་རྟོག་པའོ། །
en: Moreover, the purity of the three spheres is the realization that the aggregates are the same as the Dharma aggregate, that the elements are the same as the realm of phenomena, and that the sense sources are like an empty village.

source: གཞན་ཡང་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ནི་སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། མཚན་མ་མེད་པ་ལ་ཡིད་ཆེས་པ་དང་། སྨོན་པ་མེད་པ་ལ་སོམ་ཉི་མེད་པ་སྟེ།
en: Moreover, the purity of the three spheres is trust in emptiness, confidence in signlessness, and certainty in wishlessness.

source: བློ་གྲོས་རྒྱ་མཚོ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་འགྱུར་བའོ། །
en: Sāgaramati, the purity of the three spheres will purify all phenomena.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཡེ་ཤེས་ལ་མཁས་པར་བྱའོ།། །།
en: Thus, Sāgaramati, bodhisattvas must become skilled in the wisdom of the purity of the three spheres.”

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་སླར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཟབ་མོ་འཚལ་བ་དང་ལྡན་པ་ནི་ངོ་མཚར་ཏོ། །
en: “Blessed One, the understanding of the profound Dharma held by bodhisattvas who are irreversibly destined for awakening is astounding.

source: བཅོམ་ལྡན་འདས་ཆོས་འཚལ་བ་འདི་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་ཅི་འདྲ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed One, please describe the skill in dedication of such bodhisattvas who have this kind of understanding of the Dharma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བློ་གྲོས་རྒྱ་མཚོ་ས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྔོན་གྱི་ཤུགས་ཀྱིས་བྱ་བ་བྱེད་དེ།
en: “Sāgaramati,” answered the Blessed One, “bodhisattvas who live by this, act based on their past momentum.

source: དེ་དག་གང་གི་ཚེ་མཉམ་པར་མ་བཞག་པར་གནས་པ་དེའི་ཚེ་ན་ཡང་སྔོན་འཕངས་པའི་ཡོངས་སུ་བསྔོ་བ་འདི་བརྒྱ་ལམ་ན་ཡང་ཆུད་ཟ་བར་མི་འགྱུར་རོ། །
en: Even when they are not resting in equipoise, the dedication that they formed in the past continues to have an effect.

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཕྱིར་སྐྱེས་བུ་མཁས་པ་ཁ་ཅིག་དཔེ་བསྟན་པས་བཤད་པའི་དོན་ཤེས་པར་འགྱུར་བས་ཁྱོད་ལ་དཔེ་བྱའོ། །
en: For that, Sāgaramati, here are some analogies for you to consider, since it is through analogies that some learned people understand what is meant.

source: གང་གི་ཚེ་བུ་རམ་ཤིང་གི་ཞིང་ངམ། འབྲས་སཱ་ལུའི་ཞིང་ངམ། རྒུན་འབྲུམ་གྱི་ཞིང་རྣང་སྒལ་བྱས་པར་གྱུར་པ་
en: Suppose that a farmer digs irrigation ditches in all his fields of sugarcane, rice, or grapes.

source: དེ་ལ་མི་ཞིག་གིས་རྣང་ཐམས་ཅད་ལ་ཡུར་བ་ཅི་རིགས་པར་བཏོད་ནས། རྐ་ནས་ཆུ་ཕབ་སྟེ་ཡལ་བར་བོར་ནས་ཉལ་བ་དང་། དེ་ནས་མི་དེ་ཉལ་ཡང་ཡུར་བ་ཇི་ལྟ་བཏོད་པ་བཞིན་དུ་ཆུ་འབབ་སྟེ།
en: If he directs water along the irrigation channels, then, even when he is resting, the water will flow along the channels that he has dug.

source: དེ་ལ་མི་དེ་བརྩོན་པར་བྱ་མི་དགོས་ཤིང་བསྒྲིམ་མི་དགོས་པར་རྣང་ཐམས་ཅད་ཆུས་གང་བར་འགྱུར་རོ། །
en: The fields will be irrigated with water without him needing to exert himself or focus on the task.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་མ་བཞག་ཀྱང་དགེ་བའི་རྩ་བ་དེ་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱུད་རྣམས་ལ་ཡོངས་སུ་སྔོ་བར་བྱེད་དེ་
en: Sāgaramati, likewise, even when bodhisattvas are not resting in equipoise, they dedicate their roots of virtue to the mindstreams of all beings.

source: ཐབས་ཀྱིས་དངོས་པོ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་དེ་དག་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱིར་ཡོངས་སུ་བསྔོའོ། །
en: Then, in accordance with how things are, those roots of virtue are also skillfully dedicated toward the qualities of buddhahood.

source: དེ་བསམ་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་ཅིང་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཀུན་ཏུ་བསྲུངས་པའི་ཕྱིར་མཉམ་པར་གཞག་པར་གནས་ཀྱང་དགེ་བའི་རྩ་བ་དེ་དག་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱིར་ཡོངས་སུ་སྔོ་ཞིང་།
en: Moreover, as they rest in equipoise in order to purify their minds and guard their discipline, they again dedicate their roots of virtue toward the qualities of buddhahood.

source: སྔོན་གྱི་སྨོན་ལམ་ལེགས་པར་བཏབ་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱུད་རྣམས་རླན་པར་བྱེད་དོ། །
en: It is because they have previously made such excellent aspirations that they are now able to moisten the mindstreams of beings.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་བཞག་པ་ལས་ལངས་ཀྱང་རུང་སྟེ། དགེ་བའི་རྩ་བ་རྣམས་སྔོན་ཤིན་ཏུ་འཕངས་པ་དང་། སེམས་ལས་སུ་རུང་བ་དང་། དྲན་པ་མི་གཡེང་བ་དང་། ཐེག་པ་དམན་པ་དང་བྲལ་བ་དང་། ཐེག་པ་ཆེན་པོར་སྨོན་ལམ་བཏབ་པའི་ཕྱིར་དགེ་བའི་རྩ་བ་རྣམས་བརྒྱ་ལམ་ན་ཡང་ཐམས་ཅད་མཁྱེན་པར་ཡོངས་སུ་མི་སྔོ་མི་སྲིད་པར་འདི་ལྟར་རིག་པར་བྱའོ། །
en: “Sāgaramati, from this analogy you should understand that because bodhisattvas are propelled by their past roots of virtue, have pliant minds, have undistracted mindfulness, are free from the Lesser Vehicle, and have made aspirations toward the Great Vehicle, they can arise from equilibrium and they will in all cases dedicate their roots of virtue to omniscience.

source: རི་སུལ་ཆེན་པོ་ཞིག་ན་ཤིང་ཞིག་སྐྱེས་པར་གྱུར་ལ་དེ་མི་ཞིག་གིས་རྩ་བ་ནས་བཅད་པར་བརྩམས་ནས་དེ་ཆོད་མ་ཐག་ཏུ་གང་དུ་ཡོ་བ་དང་། གང་དུ་ཕྱོགས་པ་དེར་འགྱེལ་ལོ། །
en: if a person were to uproot a tree that had been growing in a steep mountain valley, then it would fall in whichever direction it had been leaning or bending toward.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡུན་རིང་པོ་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གཞོལ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འབབ་པས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསོགས་ཏེ་བསགས་ནས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད།
en: Likewise, Sāgaramati, by inclining and leaning toward omniscience over a long period of time, bodhisattvas dedicate all the merit that they gather to omniscience.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་ཡོངས་སུ་སྔོ་བར་བྱེད།
en: They dedicate it to protect all beings.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་འཆད་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་སྔོ་བར་བྱེད།
en: They dedicate it so that the lineage of the Three Jewels may remain uninterrupted.

source: ལུས་ཀྱི་རྒྱན་དང་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་སྔོ་བར་བྱེད།
en: They dedicate it so their physical manifestation and the major and minor marks may be perfected.

source: ཚིག་གི་རྒྱན་དང་ཆོས་བསྟན་པ་དོན་ཡོད་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་སྔོ་བར་བྱེད།
en: They dedicate it so their verbal manifestation and Dharma teachings may be meaningful.

source: སེམས་ཀྱི་རྒྱན་དང་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་ལས་མི་གཡེང་བར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་སྔོ་བར་བྱེད་དེ་
en: They dedicate it so their mental manifestation and the absorption that recollects the Buddha will not get distracted.

source: བསྒྲིམ་པ་མེད་ཅིང་ལྷུན་གྱིས་གྲུབ་པར་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོའོ། །
en: They dedicate all roots of virtue to omniscience spontaneously and without effort.

source: སྔོན་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་བསྔོས་པ་དེས་ཐེག་པ་གཞན་དུ་མི་ལྟུང་ཞིང་མཉམ་པར་བཞག་ཀྱང་རུང་ལངས་ཀྱང་རུང་སྟེ།
en: By dedicating, those who have become skilled in means do not fall prey to other vehicles and it makes no difference whether they are in equipoise or not.

source: བརྒྱ་ལམ་ན་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་མི་སྲིད་དོ། །
en: It is impossible for them not to complete their cultivation of the factors of awakening.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན། དགེ་སློང་འགོག་པ་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ་
en: “Sāgaramati, to draw another analogy, consider a monk who rests in equipoise within cessation.

source: གཎ་ཌཱིའི་སྒྲ་ལ་གནས་པར་བྱས་ཏེ་སྙོམས་པར་ཞུགས་ན་གཎ་ཌཱིའི་སྒྲ་དེ་དེའི་འགོག་པ་ལ་ཡང་མི་གནས་མ་འབྲེལ་
en: He may observe the sound of the gaṇḍī , but the sound of the gaṇḍī of course does not exist within the monk’s cessation and it is also not connected to that state.

source: མོད་ཀྱི་གཎ་ཌཱིའི་སྒྲ་དེས་འགོག་པ་ལས་ལྡང་ངོ་། །
en: Still, the sound of the gaṇḍī does cause him to emerge from the state of cessation.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པར་བྱ་སྟེ།
en: Likewise, Sāgaramati, bodhisattvas also maintain great compassion in order to free all beings. Thinking,

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པར་བྱ།
en: ‘I will protect and liberate all beings!’

source: ཡོངས་སུ་དགྲོལ་བར་བྱའོ་ཞེས་བྱང་ཆུབ་ཀྱི་རྣམ་པས་མངོན་པར་བསྒྲུབས་པའི་བྱམས་པས་སེམས་ཅན་ཐམས་ཅད་ཁྱབ་པར་བྱས་ནས་ཟབ་པ།
en: they extend a profound love to all beings, that manifests from the aspects of awakening.

source: ཟབ་མོར་སྣང་བ་སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་མི་རྒྱུ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཀྱང་དེ་སྔོན་སེམས་ཅན་རབ་ཏུ་ཐར་བར་བྱ་བའི་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་དེ་དང་ལྡན་པས་ཉན་ཐོས་ཀྱི་སར་མི་ལྟུང་རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་སྟེ
en: Then, later, though they rest in a profoundly illuminating absorption that is unmoved by mind, mentation, or consciousness, they will not regress to the level of a hearer or a solitary buddha, because they have previously experienced the great compassion that seeks to free all beings.

source: དྲན་པ་དང་ཤེས་བཞིན་གྱིས་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་བསྒྲུབ་ཅིང་སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: When they arise from that absorption with mindfulness and awareness, they accomplish the factors of awakening and ripen beings.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟར་ཞི་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཀྱང་ཉན་ཐོས་ཀྱི་རྣམ་པར་གྲོལ་བའམ། རང་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བར་མི་ལྟུང་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་སྦྱོང་བ་བྱེད་པའི་ཁྱད་པར་ལ་ལྟོས།
en: Sāgaramati, even though they rest in equipoise in the absorption of peace in this manner, they will not fall into the liberation of the hearers or solitary buddhas. Such is the unique training of the bodhisattvas!

source: མི་གཉིས་ཤིག་ཡོད་པ་ལ་དེ་ལ་མི་གཅིག་ནི་བདག་རྡོ་རྗེའི་གོ་ཆ་བགོས་ནས་མེ་འབར་བའི་ནང་དུ་མཆོངས།
en: there are two people. One of them jumps into a roaring fire while wearing indesctructible armor.

source: མི་ཅིག་ཤོས་ནི་བདག་རྩྭ་དང་སོག་མའི་གོ་ཆ་བགོས་ནས་མེ་འབར་བའི་ནང་དུ་མཆོངས་ན།
en: Another jumps into a roaring fire while wearing armor made of grass and husks.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: What do you think happens, Sāgaramati?

source: མི་དེ་གཉིས་ལས་གང་ཚིག་པར་འགྱུར།
en: Which one of them will get burned?

source: གང་ཚིག་པར་མི་འགྱུར།
en: Which one will not get burned?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མི་གང་རྡོ་རྗེའི་གོ་ཆ་འཚལ་ནས་ཞུགས་འབར་བའི་ནང་དུ་མཆོངས་པ་དེ་ནི་རྡོ་རྗེའི་གོ་ཆ་དེས་ཡོངས་སུ་བསྲུངས་པས་ཞུགས་ཀྱི་ནང་དུ་མཆིས་ཀྱང་མི་འཚིག་གོ། །
en: “Blessed One, the one who jumps into the roaring fire with the indestructible armor will be protected by the indestructible armor. Though he is within the fire, he won’t burn.

source: བཅོམ་ལྡན་འདས་མི་གང་རྩྭ་དང་སོག་མའི་གོ་ཆ་འཚལ་ནས་ཞུགས་འབར་བའི་ནང་དུ་མཆོངས་པ་དེ་ནི་དེར་མཆོངས་མ་ཐག་ཏུ་ཚིག་པར་འགྱུར་རོ། །
en: Blessed One, the one who jumps into the roaring fire with armor made of grass and husks will be immediately burnt.

source: བཅོམ་ལྡན་འདས་རྩྭ་དང་སོག་མ་ནི་འཚིག་པའི་བདག་ཉིད་ལགས་ཏེ།
en: Blessed One, because grass and husks are flammable.

source: ཞུགས་ཀྱིས་འཚིག་པ་སྲུང་མི་བཟོད་དོ། །
en: They cannot offer protection from a roaring fire.”

source: བློ་གྲོས་རྒྱ་མཚོ་ཇི་ལྟར་རྡོ་རྗེའི་གོ་ཆ་བགོས་པའི་མི་དེ་མེའི་ནང་དུ་སོང་ཡང་མི་འཚིག་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེའི་གོ་ཆ་དང་། ལྷག་པའི་བསམ་པ་སྲ་བའི་རྡོ་རྗེའི་གོ་ཆ་བགོས་ནས་སེམས་ཅན་རབ་ཏུ་ཐར་པར་བྱ་བར་དམིགས་པ་ལ་གནས་ཏེ
en: “Sāgaramati, just as the person wearing indestructible armor is not burned as he jumps into that fire, bodhisattvas wearing the armor of great love and compassion, and the sturdy indestructible armor of intention, focus on freeing beings.

source: ཆོས་ཐམས་ཅད་ལ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་རྟོགས་པ་ཡང་བཏང་ལ་
en: They generate a realization of phenomena’s emptiness, signlessness, wishlessness, and their unconditioned, unborn, and non-arising quality.

source: ཞི་བའི་ཏིང་ངེ་འཛིན་དེ་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ངེས་པར་གྱུར་པ་ལ་ཡང་མི་འཇུག་འབྲས་བུ་འཐོབ་པར་ཡང་མི་བྱེད་པར་
en: Although they rest in equipoise in the absorption of peace, they do not enter into the fixed states of the hearers or solitary buddhas, or try to achieve their results.

source: ཏིང་ངེ་འཛིན་དེ་ལ་ཡང་མྱོང་ཞིང་ཟིལ་གྱིས་མནན་ཏེ་ཡང་མ་ཉམས་མ་སྣད་པར་ལྡང་ངོ་། །ལངས་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: They experience their absorption, and overcome it and arise from it without detriment or injury, whereupon they purify buddha realms and perfect the wisdom of buddhahood.

source: བློ་གྲོས་རྒྱ་མཚོ་ཇི་ལྟར་རྩྭ་དང་སོག་མའི་གོ་ཆ་བགོས་པའི་མི་དེ་མཆོངས་མ་ཐག་ཏུ་མེས་ཚིག་པར་འགྱུར་བ་
en: “Sāgaramati, just as the person is burned by the fire as soon as he jumps in wearing armor made of grass and husks,

source: དེ་བཞིན་དུ་བློ་གྲོས་རྒྱ་མཚོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་འཁོར་བས་འཇིགས་སྐྲག་པ་སྲིད་པ་ལ་ཀུན་ཏུ་འབར་བར་བལྟ་སྟེ
en: likewise, Sāgaramati, a person on the vehicle of the hearers is terrified of saṃsāra and considers existence as if it is aflame.

source: སེམས་ཅན་རྣམས་ཡལ་བར་བོར་ནས་སྙིང་རྗེ་ཆེན་པོ་དང་བྲལ་ཏེ་
en: Thus, they ignore beings and are without great compassion.

source: ཞི་བ་ཞི་བའི་ཏིང་ངེ་འཛིན་ལ་རེག་ནས་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ།
en: Reaching peace and a peaceful absorption, they get stuck and have no chance for further progress.

source: གང་བརྒྱད་པ་ལ་འབྲས་བུ་མ་ཐོབ་པར་ལྡང་བ་དེ་ནི་གནས་མེད་དོ། །
en: Without attaining the result of the eighth stage, it is impossible for them to arise from their absorption.

source: ཉན་ཐོས་ནི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་མ་བསགས་པའི་ཕྱིར་རོ། །
en: It is because hearers do not gather the accumulations of merit and wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཚད་མེད་པ་བསགས་པ་སྟེ།
en: On the other hand, bodhisattvas gather immeasurable accumulations of merit and wisdom.

source: དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་རྫོགས་ཀྱི་བར་དུ་བར་སྐབས་སུ་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱེད་དོ། །
en: Thus, in the interim before they perfect the qualities of buddhahood, they do not actualize the limit of reality.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བའི་ཆོས་ཐམས་ཅད་ལ་མེ་འབར་བ་ལྟ་བུའི་འདུ་ཤེས་བསྐྱེད་ལ་ཆོས་དེ་དག་ལ་ཡང་སོ་སོར་བརྟག་པར་བྱ།
en: Sāgaramati, in this way bodhisattvas perceive all phenomena—which are emptiness, signlessness, wishlessness, unconditioned, unborn, and non-arising—as a blazing fire and they investigate them.

source: ཆོས་དེ་དག་ཤེས་པ་ལ་ཡང་རྣམ་པར་དཔྱོད་པར་བྱ་ཞིང་ཡང་དག་པའི་མཐའ་ཡང་མངོན་སུམ་དུ་མི་བྱའོ། །
en: Even though they perceive such phenomena, they must examine them and thus avoid actualizing the limit of reality.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པར་བྱའོ། །
en: “For this reason, Sāgaramati, bodhisattvas must be skilled in dedication.

source: བློ་གྲོས་རྒྱ་མཚོ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཟབ་མོ་རྣམས་ལ་ཡང་སྤྱོད་ལ་བར་སྐབས་སུ་ཡང་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱེད་དོ། །
en: Sāgaramati, bodhisattvas who are skilled in dedication perceive profound phenomena, yet for the time being they do not actualize the limit of reality.

source: བློ་གྲོས་རྒྱ་མཚོ་ཡོངས་སུ་བསྔོ་བ་ཞེས་བྱ་བ་ཅི་ལ་བྱ་ཞེ་ན།
en: What does dedication refer to, Sāgaramati?

source: འདི་ལྟ་སྟེ། ཐེག་པ་ཆེན་པོ་དེ་ཉིད་ལ་སེམས་གཞོལ་བ་དང་འདུན་པ་དང་མངོན་པར་ཕྱོགས་པ་དང་ཡོངས་སུ་ཕྱོགས་པ་སྟེ་ཐེག་པ་གཞན་དུ་མ་ཡིན་པའོ། །
en: It means to be diligent in, interested in, oriented toward, and directed toward the Great Vehicle and no other vehicle.

source: དེའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བ་ཞེས་བྱའོ། །
en: That is the reason it is called ‘dedication.’

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན། རྫ་མཁན་གྱིས་འཇིམ་པའི་གོང་བུ་འཁོར་ལོའི་སྟེང་དུ་གཞག་ཀྱང་མ་བསྐོར་ན་སྣོད་ཀྱི་མིང་མི་འཐོབ་སྟེ།
en: “Sāgaramati, to draw an analogy, if a potter places a lump of clay upon his wheel but does not throw it, it cannot rightly be called a pot.

source: འཇིམ་པའི་གོང་བུ་ཉིད་ཀྱི་གྲངས་སུ་འགྲོའོ། །
en: It is still considered just a lump of clay.

source: གང་གི་ཚེ་བསྐོར་བར་གྱུར་པ་དེའི་ཚེ་སྣོད་ཀྱི་མིང་འཐོབ་བོ། །
en: If it is thrown, then it can be called a pot.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་མང་པོ་བསགས་པ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མ་བསྔོས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་མི་ཐོབ་ཀྱི་
en: Sāgaramati, likewise, even though bodhisattvas accumulate myriad roots of virtue, if they do not dedicate them to omniscience, they cannot rightly be called perfections.

source: གང་གི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པར་གྱུར་པ་དེའི་ཚེ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་འཐོབ་བོ། །
en: If they are dedicated to omniscience, then they can be called perfections.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན། གསེར་དུལ་མའི་གར་བུ་ཡོངས་སུ་མ་བསྒྱུར་ན་རྒྱན་གྱི་མིང་མི་འཐོབ་སྟེ་
en: “Sāgaramati, to draw another analogy, if a lump of gold ore is not processed, it cannot rightly be called jewelry.

source: གསེར་གྱི་གར་བུ་ཉིད་ཀྱི་གྲངས་སུ་འགྲོའོ། །
en: It is still considered a lump of gold.

source: དེ་ཉིད་ཡོངས་སུ་བསྒྱུར་ན་རྒྱན་གྱི་མིང་འཐོབ་བོ། །
en: When it has been transformed, then it can be called jewelry.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་ཡང་ཡོངས་སུ་མ་བསྔོས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་མི་འཐོབ་ཀྱི་
en: Sāgaramati, likewise, if a bodhisattva’s roots of virtue are not dedicated, they cannot rightly be called perfections.

source: དེ་ཉིད་ཡོངས་སུ་བསྔོས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་འཐོབ་བོ། །
en: If they are dedicated, then they can be called perfections.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་རྟག་པར་རྒྱུན་ཏུ་འདྲེས་པ་མེད་པའི་ཡིད་ཀྱིས་དགེ་བའི་རྩ་བ་བསགས་ཤིང་བསགས་པ་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: “Thus, Sāgaramati, bodhisattvas must always gather roots of virtue with an undivided mind and dedicate them to omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཟབ་མོ་རྣམས་ལ་ཡང་སྤྱོད་ལ་བར་སྐབས་སུ་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱེད་དོ། །
en: Bodhisattvas who dedicate to omniscience engage with profound phenomena and for the time being do not actualize the limit of reality.”

source: ཡོངས་སུ་བསྔོ་བའི་ལེའུ་ཞེས་བྱ་སྟེ་དགུ་པའོ།། །།
en: [Chapter Nine: Dedication]

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་འཁྲུལ་པ་འདི་སྙེད་ཅིག་བསྲུང་ཡང་འཁྲུལ་པར་མི་འགྱུར་བ་ནི་བགྱི་དཀའ་བ་བགྱིད་པའོ། །
en: “Blessed One, even though bodhisattvas guard against confusion to this extent, they must work hard to be free from confusion.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་དུ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་དང་། ཐབས་ལ་མཁས་པ་འཚལ་བར་བགྱིའོ། །
en: Blessed One, for that reason bodhisattvas are continuously skilled in dedication and skilled in means.

source: བཅོམ་ལྡན་འདས་ཐབས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་ཞུགས་ཀྱང་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱིས་འཁྲུགས་པར་མི་འགྱུར་ཏེ
en: Blessed One, through skillful means, when bodhisattvas practice concentration, freedom, absorption, and equipoise, they are not disturbed by the concentration, freedom, absorption, and equipoise.

source: ཐབས་མཁས་པ་དེས་བགྱི་བ་ཐམས་ཅད་ཀྱང་སྟོན་ལ་བགྱི་བར་ལྟུང་བར་ཡང་མི་འགྱུར།
en: Through skill in means, they demonstrate all these deeds but do not fall prey to doing things.

source: ཆོས་མཉམ་པ་ཉིད་ལ་ཡང་གནས་ལ་སེམས་ཅན་ལོག་པ་ཉིད་དུ་མཆིས་པ་རྣམས་ལ་ཡང་དག་པ་ཉིད་ཀྱི་ངེས་པར་གྱུར་པའི་སླད་དུ་ཆོས་ཀྱང་སྟོན་ཅིང་
en: They sustain the sameness of phenomena and teach the Dharma in order to bring beings who have gone astray to the fixed state of reality.

source: བསམ་པ་ཡོངས་སུ་མ་རྫོགས་ཀྱི་བར་དུ་བདག་ངེས་པར་གྱུར་པ་དེར་ཡང་མི་ལྟུང་ངོ་། །
en: Until they complete their intention, they do not themselves fall into that state.”

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་དེ་བཞིན་ནོ། །
en: “That is how it is, Sāgaramati.

source: ཇི་སྐད་དུ་སྨྲས་པ་བཞིན་ཏེ།
en: You have described it accurately.

source: བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་དུ་ཐབས་ལ་མཁས་པ་འདོད་པར་བྱའོ། །
en: Bodhisattvas must desire to be completely skilled in means.

source: བློ་གྲོས་རྒྱ་མཚོ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བྱང་ཆུབ་ཡོད་ཀྱི་ཐབས་ལ་མི་མཁས་པ་ལ་ནི་བྱང་ཆུབ་མེད་དོ། །
en: Sāgaramati, awakening is possible for bodhisattvas who are skilled in means but not for those who are not.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ། དཔེར་ན།
en: “Sāgaramati, to draw an analogy,

source: སྣོད་གཅིག་གི་ནང་དུ་ཚོན་སྣ་གསུམ་སྟེ། སྣ་གཅིག་ནི་ཁ་དོག་སྔོན་པོ། །སྣ་གཅིག་ནི་ཁ་དོག་དམར་པོ། །སྣ་གཅིག་ནི་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་སེར་པོ་བླུགས་ལ་ཚོན་གྱི་སྣོད་གཅིག་པུ་དེར་རས་ཁ་བསྒྱུར་བ་གསུམ་སྟེ།
en: imagine that a single container is used to dye three pieces of cloth three different colors (blue, red, and golden yellow).

source: གཅིག་ནི་རས་ཤོག་པོ་ཡུག་སྔོན་པོར་ཁ་བསྒྱུར་བ། གཅིག་ནི་རས་ཕྲན་ཡུག་དམར་པོར་ཁ་བསྒྱུར་བ། གཅིག་ནི་རས་བཅོས་བུ་རིན་ཐང་མེད་པ་སེར་པོ་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་ཁ་བསྒྱུར་བ་ཟུང་གཅིག་བཅུག་ལ།
en: One full measure of cloth is dyed blue, one half measure of cloth is dyed red, and one piece of exquisite and priceless cloth is dyed golden yellow.

source: དེ་དག་སྣོད་གཅིག་གི་ནང་དུ་བཅུག་སྟེ་བསྩུབས་ན་ཇི་ལྟར་ཁ་བསྒྱུར་བའི་བྱེ་བྲག་བཞིན་དུ་ཚོན་འཛིན་ཏེ
en: As they are put into the container and worked over, the cloth will assume the color of the dye that is applied.

source: གང་ཚོན་སྔོན་པོས་ཁ་བསྒྱུར་བ་དེ་ནི་ཁ་དོག་སྔོན་པོར་འགྱུར། གང་ཚོན་དམར་པོས་ཁ་བསྒྱུར་བ་དེ་ནི་ཁ་དོག་དམར་པོར་འགྱུར། གང་ཚོན་སེར་པོ་གསེར་ལྟ་བུས་ཁ་བསྒྱུར་བ་དེ་ནི་ཁ་དོག་སེར་པོ་གསེར་ལྟ་བུར་འགྱུར་ཡང་སྣོད་དེ་ལ་ནི་རྣམ་པར་རྟོག་པར་འགྱུར་བ་གང་ཡང་མེད་དོ། །
en: The cloth that is dyed blue becomes blue, the one that is dyed red becomes red, and the piece that is dyed golden yellow becomes golden yellow. However, the container entertains no concepts about this whatsoever.
